t1s1 = [[['懊'],'㤇'],
      [['芭','笆','粑'],'巴'],
      [['帮'],'邦'],
      [['蓖','篦','蔽'],'芘'],
      [['壁'],'坒'],
      [['萹','藊','稨'],'扁'],
      [['摒'],'屏'],
      [['病'],'疒'],
      [['播'],'抪'],
      [['彩'],'采'],
      [['餐'],'歺'],
      [['舱'],'仓'],
      [['藏'],'䒙'],
      [['衩','扠','杈','汊'],'叉'],
      [['葱'],'茐'],
      [['答'],'荅'],
      [['蛋'],'旦'],
      [['道'],'辺'],
      [['叮','盯','钉','靪'],'丁'],
      [['董'],'苳'],
      [['懂'],'㤏'],
      [['蹲'],'𧿬'],
      [['燉'],'炖'],
      [['贰'],'弍'],
      [['愤'],'忿'],
      [['孵'],'孚'],
      [['伕'],'夫'],
      [['副'],'付'],
      [['秆','竿'],'杆'],
      [['钩'],'勾'],
      [['灌','盥'],'浂'],
      [['鳜'],'桂'],
      [['裹'],'果'],
      [['薅'],'䒵'],
      [['盒'],'合'],
      [['葫','猢','蝴','糊'],'胡'],
      [['籍'],'笈'],
      [['建'],'迠'],
      [['豇'],'江'],
      [['跤'],'交'],
      [['椒'],'茭'],
      [['街'],'亍'],
      [['阱'],'井'],
      [['境'],'㘫'],
      [['韭'],'艽'],
      [['酒'],'氿'],
      [['橘'],'桔'],
      [['慷'],'忼'],
      [['糠'],'粇'],
      [['靠'],'俈'],
      [['蓝','篮'],'兰'],
      [['澜','滥'],'㳕'],
      [['荔'],'艻'],
      [['璃'],'玏'],
      [['潦'],'了'],
      [['寮','寥'],'㝋'],
      [['磷'],'砱'],
      [['龄'],'令'],
      [['掳'],'虏'],
      [['貌'],'皃'],
      [['漆'],'㲺'],
      [['歧'],'岐'],
      [['潜'],'汘'],
      [['歉'],'倩'],
      [['墙'],'垟'],
      [['渠'],'洰'],
      [['壤'],'圵'],
      [['煽','搧'],'扇'],
      [['绱','鞝'],'上'],
      [['杓'],'勺'],
      [['私'],'厶'],
      [['算'],'祘'],
      [['泰'],'太'],
      [['檀'],'枟'],
      [['停'],'仃'],
      [['舞'],'午'],
      [['稀'],'希'],
      [['熄'],'息'],
      [['萧'],'肖'],
      [['信'],'伩'],
      [['雄'],'厷'],
      [['修'],'㣊'],
      [['宣'],'㝉'],
      [['癣'],'㾌'],
      [['雪'],'彐'],#
      [['阎'],'闫'],
      [['臆'],'肊'],
      [['迎'],'迊'],
      [['游'],'沋'],
      [['遇'],'迂'],
      [['预','豫'],'予'],
      [['圆'],'元'],
      [['源'],'沅'],
      [['账'],'帐'],
      [['籽'],'子'],
      [['嘴'],'咀'],
      [['座'],'坐'],
      [['哔叽'],'毕几'],
      [['枓栱'],'斗拱'],
      [['咔叽'],'卡几'],
      [['蝌蚪'],'科斗'],
      [['曚昽','朦胧','蒙眬'],'龙'],
      [['霹雳'],'辟历'],
      [['蚯蚓'],'丘引']]
t1s2 = [[['冀'],'丠'],
        [['留'],'畄'],
        [['堂'],'坣'],
        [['锡'],'钖'],
        [['樱'],'桜'],
        [['卒'],'卆'],
        [['悴'],'忰'],
        [['碎'],'砕'],
        [['瘁'],'疩'],
        [['粹'],'粋'],
        [['翠'],'翆'],
        [['醉'],'酔'],
t2s1 = [[['癍'],'斑'],
        [['鞭'],'卞'],
        [['辨','辩','辫'],'弁'],
        [['勃','渤','脖','饽'],'孛'],
        [['簸'],'波'],
        [['澈'],'彻'],
        [['蹙'],'促'],
        [['戴'],'代'],
        [['凋','碉','雕'],'刁'],
        [['斗'],'陡'],
        [['嘟'],'都'],
        [['煅'],'锻'],
        [['墩','礅','蹾','撉'],'敦'],
        [['筏','阀','垡'],'伐'],
        [['袱','匐'],'伏'],
        [['傅'],'付'],
        [['擀'],'赶'],
        [['赣'],'干'],
        [['扞'],'捍'],
        [['寰'],'环'],
        [['徽'],'辉'],
        [['嫉'],'忌'],
        [['捡'],'拣'],
        [['诫'],'戒'],
        [['襟'],'衿'],
        [['飓'],'巨'],
        [['筐','框','眶','诓','哐'],'匡'],
        [['镰'],'连'],
        [['镣'],'钌'],
        [['噜'],'鲁'],
        [['旅','膂'],'吕'],
        [['蜜','密'],'宓'],
        [['藐'],'秒'],
        [['凝'],'泞'],
        [['襻'],'袢'],
        [['僻'],'辟'],
        [['拚'],'拼'],
        [['柒'],'㲺'],
        [['签'],'佥'],
        [['砂'],'沙'],
        [['墒'],'垧'],
        [['蒜'],'祘'],
        [['镗','嘡','膛'],'坣'],
        [['童'],'仝'],
        [['豌'],'宛'],
        [['诿','萎','痿'],'委'],
        [['慰'],'尉'],
        [['鑫'],'欣'],
        [['胸'],'匈'],
        [['渲'],'㝉'],
        [['檐'],'沿'],
        [['颜'],'彦'],
        [['搾'],'乍'],
        [['蘸'],'沾'],
        [['骤'],'驺'],
        [['谘'],'咨'],
        [['鬃'],'骔'],
        [['癍'],'斑'],
        [['鞭'],'卞'],
        [['辨','辩','辫'],'弁'],
        [['叮咛'],'丁宁'],
        [['哆嗦'],'多索'],
        [['吩咐'],'分付'],
        [['疙瘩','圪垯','纥𫄤'],'咯嗒'],
        [['鬎鬁'],'瘌鬁'],
        [['阑尾'],'兰尾'],
        [['嘹喨'],'辽亮'],
        [['蹓跶'],'蹓达'],
        [['罗嗦','噜苏'],'罗索'],
        [['柠檬'],'宁檬'],
        [['磅礡'],'㝑礡'],
        [['徬徨','彷徨'],'㝑皇'],
        [['舢舨'],'舢板'],
        [['鹦鹉'],'鹦武']]
t2s2 = [[['澳'],'沃'],
        [['储','贮'],'㑁'],
        [['捣'],'㧅'],
        [['蝶'],'蛈'],
        [['敢'],'攼'],
        [['焊'],'㶥'],
        [['壑'],'垥'],
        [['激'],'㲹'],
        [['健'],'伣'],
        [['裤'],'衭'],
        [['篱'],'竻'],
        [['犁'],'牞'],
        [['腻'],'胒'],
        [['谴'],'谴'],
        [['瘸'],'疦'],
        [['霞'],'雫'],
        [['掀'],'㧥'],
        [['𣔙','锨'],'㭠'],
        [['摇'],'扷'],
        [['椅'],'𣎷'],
        [['屹'],'𡴭'],
        [['癔'],'𤴥'],
        [['越'],'迌'],
        [['渣'],'泎'],
        [['铡'],'钆'],
t2s3 = [[['得'],'㝵'],
        [['费'],'弗'],
        [['蜂','峰','烽','锋'],'夆'],
        [['鼓','臌'],'壴'],
        [['既'],'旡'],
        [['疆','缰'],'畺'],
        [['鞠','掬'],'匊'],
        [['垒','儡'],'厽'],
        [['漏'],'屚'],
        [['没'],'殳'],
        [['墓'],'圶'],
        [['脑','瑙','碯','堖'],'㐫'],
        [['缺'],'夬'],
        [['酸','痠'],'夋'],
        [['微'],'𡵉'],
        [['涡','娲','窝','莴'],'呙'],
t2s4 = [[['旁'],'㝑'],
        [['臾'],'㬰'],
        [['隋','随'],'陏'],
t2s6 = [[['矮'],'仦'],
        [['集'],'亼'],
t2s7 = [[['割'],'刈']]

trad = input()
i = 0
result = ''
while i < len(trad):
    notMatch = True
    if notMatch:
        for a in t2s7:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t2s6:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t2s4:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t2s3:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t2s2:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t2s1:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t1s2:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        for a in t1s1:
            if i < len(trad)-1:
                if trad[i]+trad[i+1] in a[0]:
                    result = result + a[1]
                    i+=1
                    notMatch = False
            if trad[i] in a[0]:
                result = result + a[1]
                notMatch = False
    if notMatch:
        result = result + trad[i]
    i+=1
print(result)
